**PySDS Week 2 Lecture 4. V.1 **
Last author: B. Hogan

Week 2 Day 4. : Merging and grouping data 
=================

This week we are going to focus primarily on exercises where you must integrate different data sources together in a single table for analysis. 

Learning goals: 
- Understand merging / sorting
- Be able to read and write a table from iPython
- Understand one-to-many and many-to-many relationships. 
- Understanding grouping relationships
- Use a simple pivot table

Part 1. Merging data into a table
-------------------------------

The first thing we are going to do is to merge data in the simplest way possible: by adding either a row or a column to a dataset. We have already done a little bit of this implicitly in some of the lessons. 

First we will create two dataframes based on dictionaries, then we will combine them. We will do this in two ways: 
1. The same columns (adding rows) 
2. The same rows (adding columns) 

### The same columns ###

When adding data where we have the same columns, it is typically because we have new rows. This happens when we are processing data and want to add rows one at a time as the data comes in. 

*Things to remember:* 
- DataFrames have rows, and each row has an index. 
- The index can have a name, but can also be assigned automatically.

In [35]:
from pandas import Series, DataFrame
import pandas as pd 
import numpy as np
from IPython.display import display
%pylab inline

Populating the interactive namespace from numpy and matplotlib

**Initialising some tables**

The three frames below are being initalised here. The real work is in the next cell.

In [36]:

testData1 = [["a","b","c","d"],["g","h","j","k"]]
testFrame1 = pd.DataFrame(testData1)
print(testFrame1)

print()

testData2 = [["m","n","o","p"],["s","t","u","v"]]
testFrame2 = pd.DataFrame(testData2)
print(testFrame2)

print()

testData3 = [["x","y","z","aa","bb","cc"],["e","f","q","w","ww","www"]]
testFrame3 = pd.DataFrame(testData3)
print(testFrame3)

   0  1  2  3
0  a  b  c  d
1  g  h  j  k

   0  1  2  3
0  m  n  o  p
1  s  t  u  v

   0  1  2   3   4    5
0  x  y  z  aa  bb   cc
1  e  f  q   w  ww  www

### Attempt 1: Adding the frames together ###

In the first case, see what happens when we add the frames together. Because they are the same dimension, it literally concatenates within cell. If the cells are not the same size, they will repeat. See the two results below.

In [38]:
exData01 = testData1 + testData2
display(exData01)

print()

# Notice the difference between adding the lists and adding the frames. 
exFrame01 = testFrame1 + testFrame2
display(exFrame01)

print()

# Notice now the software does not know what to do adding misshapen frames. 
exFrame02 = testFrame1 + testFrame3
display(exFrame02)

[['a', 'b', 'c', 'd'],
 ['g', 'h', 'j', 'k'],
 ['m', 'n', 'o', 'p'],
 ['s', 't', 'u', 'v']]

    0   1   2   3
0  am  bn  co  dp
1  gs  ht  ju  kv

    0   1   2    3    4    5
0  ax  by  cz  daa  NaN  NaN
1  ge  hf  jq   kw  NaN  NaN

### Attempt 2: Concatenating frames ###
In the second case, we are going to concatenate the data. The first way we will be doing this is by row. Notice what happens to the indices by default.

In [39]:
testFrame4 = pd.concat(    [testFrame1, testFrame2])
testFrame4

   0  1  2  3
0  a  b  c  d
1  g  h  j  k
0  m  n  o  p
1  s  t  u  v

In [ ]:
# To really understand the method, it's useful to read the help file. 
help(pd.concat)

Below we fix this using the *ignore_index = True* argument.  

Notice also that pd.concat and DataFrame.append accomplish the same thing.

In [48]:
testFrame4 = pd.concat([testFrame1, testFrame2],ignore_index=True)
print(testFrame4)

print()

testFrame4 = testFrame1.append(testFrame2,ignore_index=True)
print(testFrame4)

   0  1  2  3
0  a  b  c  d
1  g  h  j  k
2  m  n  o  p
3  s  t  u  v

   0  1  2  3
0  a  b  c  d
1  g  h  j  k
2  m  n  o  p
3  s  t  u  v

In [49]:
testFrame4.loc[0,0] = "alpha"

testFrame2

display(testFrame4)

# testFrame4.loc["0","0"] = "alpha"

       0  1  2  3
0  alpha  b  c  d
1      g  h  j  k
2      m  n  o  p
3      s  t  u  v

In [41]:
dir(testFrame4)

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_SLICEMAP',
 '__abs__',
 '__add__',
 '__and__',
 '__array__',
 '__array_wrap__',
 '__bool__',
 '__bytes__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__le__',
 '__len__',
 '__lt__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__unicode__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_only_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_apply_broadcast',
 '_apply_empty_result',
 '_apply_raw',
 '_apply_standard',
 '_at',
 '_box_col_values',
 '_box_item_values',
 '_builtin_table',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_percentile',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_combine_const',
 '_combine_frame',
 '_combine_match_columns',
 '_combine_match_index',
 '_combine_series',
 '_combine_series_infer',
 '_compare_frame',
 '_compare_frame_evaluate',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_for_slice',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_create_indexer',
 '_cython_table',
 '_dir_additions',
 '_dir_deletions',
 '_ensure_valid_index',
 '_expand_axes',
 '_flex_compare_frame',
 '_from_arrays',
 '_from_axes',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_numeric_data',
 '_get_values',
 '_getitem_array',
 '_getitem_column',
 '_getitem_frame',
 '_getitem_multilevel',
 '_getitem_slice',
 '_gotitem',
 '_iat',
 '_iget_item_cache',
 '_iloc',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_dict',
 '_init_mgr',
 '_init_ndarray',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_cython_func',
 '_is_datelike_mixed_type',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_join_compat',
 '_loc',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_axis',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_setup_axes',
 '_shallow_copy',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_try_aggregate_string_function',
 '_typ',
 '_unpickle_frame_compat',
 '_unpickle_matrix_compat',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'boxplot',
 'clip',
 'clip_lower',
 'clip_upper',
 'columns',
 'combine',
 'combine_first',
 'compound',
 'consolidate',
 'convert_objects',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_csv',
 'from_dict',
 'from_items',
 'from_records',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'info',
 'insert',
 'interpolate',
 'is_copy',
 'isin',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'ix',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sortlevel',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_panel',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sparse',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

Now if we want to add these as **columns rather than rows**, we can use the *axis=1* (as opposed to the default axis=0 argument)

Also notice that this is not available as appending.

In [55]:
testFrame4 = pd.concat([testFrame1, testFrame2],axis=1)
testFrame4.index = ['top', 'bottom']
display(testFrame4)

print()

        0  1  2  3  0  1  2  3
top     a  b  c  d  m  n  o  p
bottom  g  h  j  k  s  t  u  v

In [56]:
testFrame4.loc["top",0] = "test"
display(testFrame4)

           0  1  2  3     0  1  2  3
top     test  b  c  d  test  n  o  p
bottom     g  h  j  k     s  t  u  v

If we want to **add a single series**, then we have to be careful about how it is structured. Noticed in the following. We can see this being done right and wrong.

In [58]:
testSeries1 = pd.Series(["alpha","bravo","charlie","delta"],name="example")

testFrame5 = testFrame1.append(testSeries1)#,ignore_index=True)
testFrame5

             0      1        2      3
0            a      b        c      d
1            g      h        j      k
example  alpha  bravo  charlie  delta

In [63]:
testSeries1 = pd.Series({2:"bravo",3:"charlie",4:"delta",1:"alpha"},name="example")

testFrame5 = testFrame1.append(testSeries1)
testFrame5

           0      1      2        3      4
0          a      b      c        d    NaN
1          g      h      j        k    NaN
example  NaN  alpha  bravo  charlie  delta

In [64]:
# Ooops! It's "Zero" indexed

testSeries1 = pd.Series({0:"alpha",1:"bravo",2:"charlie",3:"delta"},name="example")

testFrame5 = testFrame1.append(testSeries1)
testFrame5

             0      1        2      3
0            a      b        c      d
1            g      h        j      k
example  alpha  bravo  charlie  delta

Addding Columns 
==

Each DataFrame has an index and a series of columns. To add names to the index, you can assign a variable to DataFrame.index. To assign names to the columns, you can use DataFrame.columns. These are lists. They cannot be shorter or longer than the actual data frame, otherwise you will receive a ValueError.

In [68]:
testFrame5.columns = ["first","second","third","fourth"]
display(testFrame5)

print(len(testFrame5.columns))

# try:
#     testFrame5.columns = ["1first","2second","3third"]
#     display(testFrame5)
# except ValueError:
#     print("ValueError: Length mismatch")
    

# testFrame5.index = ["first_row","second_row","third_row"]
# display(testFrame5)

# try:
#     testFrame5.index = ["first_row","second_row","third_row","fourth_row"]
#     display(testFrame5)
# except ValueError:
#     print("ValueError: Length mismatch")

            first second    third fourth
first_row       a      b        c      d
second_row      g      h        j      k
third_row   alpha  bravo  charlie  delta

4

### One-to-many relationships ###

One to many relationships are really common in data wrangling. For example, you have people who are in states, and you have state level data on unemployment. How do you create a new table that includes these state-level indicators? This might be useful for a regression (particularly a popular class of regression models called 'hierarchical linear models').

In [76]:
d = {"Wales":3,"England":53,"Scotland":5,"Northern Ireland":2,"Jersey":.1}
l = list(zip(d.keys(),d.values()))
print(l)

# countryFrame = pd.DataFrame(l,columns=["Country","Population"])
# display(countryFrame)

# # country = pd.Series({"Wales":3,"England":53,"Scotland":5,"Northern Ireland":2,"Jersey":.1},name="Population")
# # countryFrame = pd.DataFrame(country)
# # countryFrame["Derp"] = countryFrame.index
# # countryFrame.reset_index(inplace=True,drop=True)
# # display(countryFrame)

countryFrame = pd.DataFrame(pd.Series(d),columns=["Population"])
countryFrame

[('Wales', 3), ('England', 53), ('Scotland', 5), ('Northern Ireland', 2), ('Jersey', 0.1)]

                  Population
England                 53.0
Jersey                   0.1
Northern Ireland         2.0
Scotland                 5.0
Wales                    3.0

In [74]:
people = [["Alice",32,"Wales"],
          ["Bob",35,"Northern Ireland"],
          ["Charlie",21,"England"],
          ["David",45,"Northern Ireland"],
          ["Ellen",21,"Scotland"],
          ["Frank",50,"England"],
          ["Grant",28,"Scotland"],
          ["Harry",36,"England"],
          ["Idris",40,"Isle of Wight"]]

peopleFrame = pd.DataFrame(people,columns=["Name","Age","Country"])
# help(peopleFrame.merge)
display(peopleFrame)

      Name  Age           Country
0    Alice   32             Wales
1      Bob   35  Northern Ireland
2  Charlie   21           England
3    David   45  Northern Ireland
4    Ellen   21          Scotland
5    Frank   50           England
6    Grant   28          Scotland
7    Harry   36           England
8    Idris   40     Isle of Wight

In [77]:
mergeFrame = peopleFrame.merge(countryFrame,left_on="Country",right_index=True)
display(mergeFrame)

mergeFrame = countryFrame.merge(peopleFrame,left_index=True,right_on="Country")
display(mergeFrame)

      Name  Age           Country  Population
0    Alice   32             Wales         3.0
1      Bob   35  Northern Ireland         2.0
3    David   45  Northern Ireland         2.0
2  Charlie   21           England        53.0
5    Frank   50           England        53.0
7    Harry   36           England        53.0
4    Ellen   21          Scotland         5.0
6    Grant   28          Scotland         5.0

   Population     Name  Age           Country
2        53.0  Charlie   21           England
5        53.0    Frank   50           England
7        53.0    Harry   36           England
1         2.0      Bob   35  Northern Ireland
3         2.0    David   45  Northern Ireland
4         5.0    Ellen   21          Scotland
6         5.0    Grant   28          Scotland
0         3.0    Alice   32             Wales

So. Merging / Joining is REALLY hard to get your head around. And it won't necessarily work the first couple times (I went through several iterations in getting the examples to work). But let's give a little overview of ways to join:

- Left: Unique rows on the left, mutliple on the right. 
- Right: Unique rows on the right, multiple on the left.
- Inner: The intersection of both frames.
- Outer: The union of both frames. 

Below is a very small crash course in "Union" and "Intersection".

In [78]:
setleft = set([1,3,5,7,9])
setright = set([1,2,3,4,5])
print("Union: PRINT ALL THE THINGS!")
print(setleft.union(setright))

print("\nIntersection: Here's what we have in common")
print(setleft.intersection(setright))

Union: PRINT ALL THE THINGS!
{1, 2, 3, 4, 5, 7, 9}

Intersection: Here's what we have in common
{1, 3, 5}

Now let's return to the data we analyzed above and explore what happens when we join in different ways. 

** Outer Join **

Notice above we include both Jersey and Isle of Wight, and then get some missing data. Country_y (which we really ought to rename) is missing for Isle of Wight and the individuals are missing for Jersey. It's the union of the keys.

In [79]:
mergeFrame = peopleFrame.merge(countryFrame,left_on="Country",right_index=True, how='outer')
mergeFrame.reset_index(drop=True)

      Name   Age           Country  Population
0    Alice  32.0             Wales         3.0
1      Bob  35.0  Northern Ireland         2.0
2    David  45.0  Northern Ireland         2.0
3  Charlie  21.0           England        53.0
4    Frank  50.0           England        53.0
5    Harry  36.0           England        53.0
6    Ellen  21.0          Scotland         5.0
7    Grant  28.0          Scotland         5.0
8    Idris  40.0     Isle of Wight         NaN
9      NaN   NaN            Jersey         0.1

** Inner Join **

Notice in this case, just like with an intersection, we get rid of the keys where there is no match in the other table. So, goodbye Isle of Wight and goodbye Jersey!

In [80]:
mergeFrame = peopleFrame.merge(countryFrame,left_on="Country",right_index=True, how='inner')
display(mergeFrame)

      Name  Age           Country  Population
0    Alice   32             Wales         3.0
1      Bob   35  Northern Ireland         2.0
3    David   45  Northern Ireland         2.0
2  Charlie   21           England        53.0
5    Frank   50           England        53.0
7    Harry   36           England        53.0
4    Ellen   21          Scotland         5.0
6    Grant   28          Scotland         5.0

** Left Join **

Notice above that we joined on left (which is "peopleFrame"). We could have also done the following, which would have been roughly equivalent (see for yourself!)

    pd.merge(peopleFrame,countryFrame,left_on="Country",right_index=True, how='left')

    peopleFrame.join(countryFrame,on="Country",how="inner",rsuffix="_x")
    
I say roughly equivalent, because the join command is actually a little more tidy than merge. Notice that the inner join doesn't have country_x and country_y, but merges those. In the end, no way is particularly "correct".

In [81]:
mergeFrame = peopleFrame.merge(countryFrame,left_on="Country",right_index=True, how='left')
mergeFrame

      Name  Age           Country  Population
0    Alice   32             Wales         3.0
1      Bob   35  Northern Ireland         2.0
2  Charlie   21           England        53.0
3    David   45  Northern Ireland         2.0
4    Ellen   21          Scotland         5.0
5    Frank   50           England        53.0
6    Grant   28          Scotland         5.0
7    Harry   36           England        53.0
8    Idris   40     Isle of Wight         NaN

In [87]:
countryFrame.columns = ["Country"]
display(countryFrame)

                  Country
England              53.0
Jersey                0.1
Northern Ireland      2.0
Scotland              5.0
Wales                 3.0

In [88]:
# countryFrame.columns = ["Country"]
peopleFrame.join(countryFrame,on="Country",how="inner",rsuffix="_rightTable")

      Name  Age           Country  Country_rightTable
0    Alice   32             Wales                 3.0
1      Bob   35  Northern Ireland                 2.0
3    David   45  Northern Ireland                 2.0
2  Charlie   21           England                53.0
5    Frank   50           England                53.0
7    Harry   36           England                53.0
4    Ellen   21          Scotland                 5.0
6    Grant   28          Scotland                 5.0

** Right Join **

Pretty much the same as the left join, except it is merging on the right instead of the left.

In [83]:
mergeFrame = peopleFrame.merge(countryFrame,left_on="Country",right_index=True, how='right')
mergeFrame

            Country     Name   Age         Country_x  Country_y
0             Wales    Alice  32.0             Wales        3.0
1  Northern Ireland      Bob  35.0  Northern Ireland        2.0
3  Northern Ireland    David  45.0  Northern Ireland        2.0
2           England  Charlie  21.0           England       53.0
5           England    Frank  50.0           England       53.0
7           England    Harry  36.0           England       53.0
4          Scotland    Ellen  21.0          Scotland        5.0
6          Scotland    Grant  28.0          Scotland        5.0
8            Jersey      NaN   NaN               NaN        0.1

** Multiple columns ** 

You'll notice that in the above example, countryFrame is really just one column of data. Let's add another column to it, and see what happens to our merging.

In [95]:
countryFrame = pd.DataFrame([["Wales",3,28],
                            ["England",53,51],
                            ["Scotland",5,46],
                            ["Northern Ireland",2,27],
                            ["Jersey",.1,58]],
                            columns=["Country","Population","Income"])
display(countryFrame)

            Country  Population  Income
0             Wales         3.0      28
1           England        53.0      51
2          Scotland         5.0      46
3  Northern Ireland         2.0      27
4            Jersey         0.1      58

Now in this case, you'll notice that we no longer have the names of the countries as indices, so we will have to change the way we merge ever so slightly.

In [96]:
mergeFrame = peopleFrame.merge(countryFrame, on="Country")
mergeFrame

      Name  Age           Country  Population  Income
0    Alice   32             Wales         3.0      28
1      Bob   35  Northern Ireland         2.0      27
2    David   45  Northern Ireland         2.0      27
3  Charlie   21           England        53.0      51
4    Frank   50           England        53.0      51
5    Harry   36           England        53.0      51
6    Ellen   21          Scotland         5.0      46
7    Grant   28          Scotland         5.0      46

Grouping Data 
===================

Broadcasting Aggregations back to the original data
---------------------------

Now with these columns imagine that we want to create some variable that is a group-level aggregation of individual level variables. Population and Income are already group-level variables . 

We can group data together using the 

    groupby(KEY) 
    
command. First we will group all the data, and then just a subset of it.

In [106]:
groupFrame = mergeFrame.groupby('Country').sum()
display(groupFrame)

                  Age  Population  Income
Country
England           107       159.0     153
Northern Ireland   80         4.0      54
Scotland           49        10.0      92
Wales              32         3.0      28

In [99]:
help(mergeFrame.groupby)

Help on method groupby in module pandas.core.generic:

groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=False, **kwargs) method of pandas.core.frame.DataFrame instance
    Group series using mapper (dict or key function, apply given function
    to group, return result as series) or by a series of columns.

    Parameters
    ----------
    by : mapping, function, str, or iterable
        Used to determine the groups for the groupby.
        If ``by`` is a function, it's called on each value of the object's
        index. If a dict or Series is passed, the Series or dict VALUES
        will be used to determine the groups (the Series' values are first
        aligned; see ``.align()`` method). If an ndarray is passed, the
        values are used as-is determine the groups. A str or list of strs
        may be passed to group by the columns in ``self``
    axis : int, default 0
    level : int, level name, or sequence of such, default None
        If the axis is a MultiIndex (hierarchical), group by a particular
        level or levels
    as_index : boolean, default True
        For aggregated output, return object with group labels as the
        index. Only relevant for DataFrame input. as_index=False is
        effectively "SQL-style" grouped output
    sort : boolean, default True
        Sort group keys. Get better performance by turning this off.
        Note this does not influence the order of observations within each
        group.  groupby preserves the order of rows within each group.
    group_keys : boolean, default True
        When calling apply, add group keys to index to identify pieces
    squeeze : boolean, default False
        reduce the dimensionality of the return type if possible,
        otherwise return a consistent type

    Examples
    --------
    DataFrame results

    >>> data.groupby(func, axis=0).mean()
    >>> data.groupby(['col1', 'col2'])['col3'].mean()

    DataFrame with hierarchical index

    >>> data.groupby(['col1', 'col2']).mean()

    Returns
    -------
    GroupBy object

You'll notice that it adds the prefix "m\_" to all the scalar values and uses all of them. This is alright, but if we want to merge these values back into the original data set, this will be a nuisance since m_Population is the same as Population since both came from the Country table to begin with. So, we can group on a slice of the dataframe. To slice the dataframe we have to query it in the following way. 

    DATAFRAME[ ['VAR1','VAR2'] ]
    
Yes, that's a list within a list. See below:

In [109]:
mergeFrame[["Country","Age","Income"]]

            Country  Age  Income
0             Wales   32      28
1  Northern Ireland   35      27
2  Northern Ireland   45      27
3           England   21      51
4           England   50      51
5           England   36      51
6          Scotland   21      46
7          Scotland   28      46

In [111]:
groupFrame = mergeFrame[["Country","Age"]].groupby('Country').mean()

groupFrame

                        Age
Country
England           35.666667
Northern Ireland  40.000000
Scotland          24.500000
Wales             32.000000

We have just one issue now - if we merge the average age back in, there is already a variable is already called Age. We can rename it before we merge it back in, but it is easier to add a prefix when we do the original grouping:

    DATAFRAME.groupby(KEY).add_prefix("mean_")

In [112]:
groupFrame = mergeFrame[["Country","Age"]].groupby('Country').mean().add_prefix("mean_")
groupFrame

                   mean_Age
Country
England           35.666667
Northern Ireland  40.000000
Scotland          24.500000
Wales             32.000000

In [113]:
newFrame = pd.merge(mergeFrame, groupFrame,left_on="Country",right_index=True)
display(newFrame)

      Name  Age           Country  Population  Income   mean_Age
0    Alice   32             Wales         3.0      28  32.000000
1      Bob   35  Northern Ireland         2.0      27  40.000000
2    David   45  Northern Ireland         2.0      27  40.000000
3  Charlie   21           England        53.0      51  35.666667
4    Frank   50           England        53.0      51  35.666667
5    Harry   36           England        53.0      51  35.666667
6    Ellen   21          Scotland         5.0      46  24.500000
7    Grant   28          Scotland         5.0      46  24.500000

Copying versus addressing
-------------------------

So, is m_Age part of the mergeFrame table now? No! Part of the way that Pandas works is to only put things in memory unless otherwise stated. See below:

In [116]:
newFrame["age_meancentered"] = newFrame["mean_Age"] - newFrame["Age"]
newFrame

,Name,Age,Country,Population,Income,mean_Age,age_meancentered
0,Alice,32,Wales,3.0,28,32.000000,0.000000
1,Bob,35,Northern Ireland,2.0,27,40.000000,5.000000
2,David,45,Northern Ireland,2.0,27,40.000000,-5.000000
3,Charlie,21,England,53.0,51,35.666667,14.666667
4,Frank,50,England,53.0,51,35.666667,-14.333333
5,Harry,36,England,53.0,51,35.666667,-0.333333
6,Ellen,21,Scotland,5.0,46,24.500000,3.500000
7,Grant,28,Scotland,5.0,46,24.500000,-3.500000

In [117]:
mergeFrame = pd.merge(mergeFrame, groupFrame,left_on="Country",right_index=True)
mergeFrame

# Ta-dah!

      Name  Age           Country  Population  Income   mean_Age
0    Alice   32             Wales         3.0      28  32.000000
1      Bob   35  Northern Ireland         2.0      27  40.000000
2    David   45  Northern Ireland         2.0      27  40.000000
3  Charlie   21           England        53.0      51  35.666667
4    Frank   50           England        53.0      51  35.666667
5    Harry   36           England        53.0      51  35.666667
6    Ellen   21          Scotland         5.0      46  24.500000
7    Grant   28          Scotland         5.0      46  24.500000